package ua.lpnu.train;

import junit.framework.TestCase;

public class InfoTest extends TestCase {
    Info info;

    public InfoTest() {
        info = new Info();
    }

    public void testStr() {
        assertEquals("""
                Вагони:
                3 типи вагонів: локомотив, пасажирський, вантажний
                Передбачено можливість:
                - Додавати нові вагони
                - Видаляти вагони
                - Шукати вагони за певними ознаками
                - Переглядати існуючі вагони
                - Зберігати вагони у файл
                Збережені вагони ініціалізуються одразу
                
                Потяги:
                З існуючих вагонів можна складати потяги.
                Загальна вага потягу не може перевищувати його тягу
                Інших обмежень не існує.
                Передбачено можливість:
                - Створювати нові потяги
                - Видаляти існуючі потяги
                - Шукати потяги за певними ознаками
                - Переглядати вже створені потяги
                - Редагувати потяги
                - Збереження потягів у файл
                
                Редагування потягів:
                - Додавання нових вагонів
                - Видалення вагонів (контролюється умова, що тяга > ваги)
                - Сортування вагонів
                
                Сортування (пріорітет):
                - Локомотиви(більша тяга)
                - Пасажирські вагони(більший комфорт, або при рівному - більше місць)
                - Вантажні вагони(більша ємність)
                
                """, info.str());
    }
}